<?php

return [
    '1' => [
        'name' => 'ブラックマヨネーズ　吉田',
        'color' => 'red',
        'description' => 'ネガティブでちょっと変わり者のあなたはブラックマヨネーズ吉田タイプです。

        この説明を読んで「そっかぁ俺変わり者なんや」
        とちょっと嬉しそうにしましたね。
        これがメンタリズムです。',
    ],

    '2' => [
        'name' => 'とろサーモン　久保田',
        'color' => 'red',
        'description' => '人間として大切な何かをなくしているあなたはとろサーモン久保田タイプです。

        性格診断の結果を書くとあなたを傷つけてしまいそうなので割愛させて頂きますね。',
    ],

    '3' => [
        'name' => 'NONSTYLE　石田',
        'color' => 'yellow',
        'description' => 'あなたはNON STYLE石田タイプです。


        以上です。',
    ],

    '4' => [
        'name' => 'NONSTYLE　井上',
        'color' => 'yellow',
        'description' => 'ナルシストで嫌われ者のあなたはNON STYLE井上タイプです。
                        まぁ、、生きてれば良いこともあると思いますよ。
                        がんばってください。',
    ],

    '5' => [
        'name' => 'サンドウィッチマン　伊達',
        'color' => 'blue',
        'description' => 'みんなから頼りにされる兄貴肌なあなたはサンドウィッチマン伊達タイプです。

        自身が傷つく事を顧みずに、弱者や部下のために立ち上がります。また子供や動物の前では警戒を解き、優しさを見せる事もあります。
        ざっくばらんで率直なコミュニケーションを好み、裏表はありません。ただ優しい言葉をかけるのが苦手なので、無愛想だと思われてしまうかもしれませんが、人望が厚く心根の優しいあなたの周りには自然と人が集まっていきます。
        
        でも、ハンバーガー屋が開いているの見て興奮するのは性癖が歪んでいるとしか思えません。',
    ],

    '6' => [
        'name' => 'ミルクボーイ　駒場',
        'color' => 'blue',
        'description' => '駒場：うちのおかんがな、ユーザーさんの性格のタイプを忘れてしまったみたいやねん

        内海：えー、ユーザーさんの性格タイプ忘れてしまうなんてどうなってんのよー　ほな俺が一緒に考えてあげるからどんな特徴があったか言うてみてよー

        駒場：ユーザーさんのおかんはな物忘れが激しいらしいねん

        内海：うーん　ミルクボーイ駒場タイプとちゃうか　その特徴はもう完全にミルクボーイ駒場や

        駒場：ミルクボーイ駒場なー

        内海：すぐ分かったやん　こんなんもー

        駒場：でもこれちょっと分からへんのやな

        内海：何が分からへんのよー

        駒場：いや、俺もミルクボーイ駒場と思うてんけどな　おかんが言うには女性人気がすごくてグッズがすぐ完売してしまう芸人さんらしいねん

        内海：あー　ほなミルクボーイ駒場と違うかぁ　駒場のグッズが売り切れるわけないもんね

        駒場：そやねん

        内海：ミルクボーイのファン層は９割男性で半数以上が我々よりも人生の先輩方やねんから　グッズなんか買うわけないもんね　他なんかもうちょっと言うてなかった

        駒場：相方が信じられへんくらい角刈りらしいねん

        内海：ほなミルクボーイ駒場やないかい　相方が角刈りの芸人なんかミルクボーイの駒場かレギュラーの松本くんしかこの世にはおらへんのやから　もうそれはミルクボーイの駒場で決まりや

        駒場：いやーでもわかれへんねん

        内海：分からへんことない　ミルクボーイの駒場で決まり

        駒場：でもおかんが言うにはミルクボーイ駒場ではないらしいねん

        内海：ほなミルクボーイ駒場ちゃうやないか

        駒場：おとんが言うにはなゴー☆ジャスちゃうかって

        内海：いや絶対ちゃうやろー もうええわ',
    ],

    '7' => [
        'name' => 'トレンディエンジェル　斎藤さん',
        'color' => 'yellow',
        'description' => 'あなたは斎藤さんではないです。
        早く働いてください。',
    ],

    '8' => [
        'name' => 'フットボールアワー　岩尾',
        'color' => 'red',
        'description' => '少し引っ込み思案ながら持ち前のユーモアと優しさでみんなから愛されるあなたはフットボールアワー岩尾タイプです。

        大人数でワイワイと盛り上がるよりも、仲の良い気の許せる友人達と少人数で遊んだりする方が性に合っているのではないでしょうか。
        また、自分の世界観をもっておりみんなの意見に流されることがなく、自分の意見をしっかりと持っているのも特徴です。
        声を荒げたり、感情的になることが少ないあなたですが、プライベートでは
        っって　お前ハゲとるやないか！！！！！！！！',
    ],

    '9' => [
        'name' => 'アンタッチャブル　ザキヤマ',
        'color' => 'blue',
        'description' => 'お調子者で人気者タイプのあなたはアンタッチャブルのザキヤマタイプです。

        出会った人を誰でも喜ばせようとします。快活で周りを楽しませるのが好きなので、優秀なムードメーカーです。
        がアゴが割れています。
        また、発想力が豊かで論理的思考も得意なので、一見関係ない複数の物事を関連付けて、新しいものを作り上げることができますがアゴが割れています。
        広い人脈を持っている事が多く、それを活かして成果を上げる事もできますがアゴが割れています。
        新しい事を始めるのを好む一方で、最後までやり遂げるのが苦手で他人の迷惑などお構いなしにアゴが割れています。
        アゴが割れていると言う一面もあるのですが、実はあなたを良く知る友人達からはアゴが割れていると言われています。',
    ],

    '10' => [
        'name' => '銀シャリ　鰻',
        'color' => 'blue',
        'description' => '明日は明日の風が吹くをモットーとする、楽天主義のあなたは銀シャリ鰻タイプです。

        楽しく生きることを人生の１番の価値とし、楽しそうと感じたことには飛びついてどんどんチャレンジしていくのがあなたの特徴です。
        楽しさを感じていれば疲れ知らずで、同時に何種類の行動を起こすことが出来ます。
        長所の裏返しとして、一つのことを長く続けるのが苦手で、何かを極めることには向いておりません。
        しかし、パワフルでポジティブなあなたの周りにはそんなあなたを面白い、支えたいと感じて人が集まってきます。
        
        うそです。
        途中まで信じてましたよね。
        あなたのそんなピュアなところが鰻タイプです。',
    ],

    '11' => [
        'name' => 'マヂカルラブリー　野田クリスタル',
        'color' => 'yellow',
        'description' => 'とにかくよくわからないあなたはマヂカルラブリー野田クリスタルタイプです。
        とにかくよくわからないです。
        とにかくわからないのでおすすめの性格診断サイトのリンク貼っときますね。
        https://www.16personalities.com/ja',
    ],

    '12' => [
        'name' => 'ブラックマヨネーズ　小杉',
        'color' => 'red',
        'description' => '自制心をどこかへ忘れてきたあなたはブラックマヨネーズ小杉タイプです。
        なんだか診断結果書くの面倒なので省略しますね。
        でも、こんな僕の怠惰を許してくれる優しいタイプの人がブラックマヨネーズ小杉タイプのあなただと信じてます。
        おやすみなさい。',
    ],

    '13' => [
        'name' => 'チュートリアル　徳井',
        'color' => 'blue',
        'description' => 'あなたはチュートリアル徳井さんタイプです。
        いやー復帰して本当によかったですね。
        M1２００５年のバーベキューのネタを見て衝撃を受けて
        ２００６年の冷蔵庫とチリンチリンのネタで完全に虜になりました。
        当時中学１年生だった僕は、ガラケーの録音機能にそのネタを入れて何回も何回も聞いていたのを思い出しました。
        しゃべくりなどのゴールデンの徳井さんもチャックおろさせてーや等で発揮する変態な徳井さんもどちらもめっちゃ好きです。
        今回は色々ありましたが、応援しています！！
        
        あ、すみません。
        性格診断の結果が全然書けてませんでしたね。
        チュートリアル徳井さんタイプのあなたは変態です。
        以上です。',
    ],

    '14' => [
        'name' => '霜降り明星　せいや',
        'color' => 'blue',
        'description' => 'すみません、性格とかはわからないのですが
        ラッキーアイテムはzoomです。',
    ],
];


//results
// １　ブラックマヨネーズ　吉田　赤
// ２　とろサーモン　久保田　赤
// ３　NONSTYLE　石田　黄
// ４　NONSTYLE　井上　黄
// ５　サンドウィッチマン　伊達　青
// ６　ミルクボーイ　駒場　青
// ７　トレンディエンジェル　斎藤さん　黄
// ８　フットボールアワー　岩尾　赤
// ９　アンタッチャブル　ザキヤマ　青
// １０　銀シャリ　鰻　青
// １１　マヂカルラブリー　野田クリスタル　黄
// １２　ブラックマヨネーズ　小杉　赤
// １３　チュートリアル　徳井　青
// １４　霜降り明星　せいや　青