<?php

return [
    '1' => [
        'name' => 'ブラックマヨネーズ　吉田',
        'description' => 'あなたは「ブラックマヨネーズ」タイプです。このタイプは...',
    ],

    '2' => [
        'name' => 'とろサーモン　久保田',
        'description' => 'あなたは「ブラックマヨネーズ」タイプです。このタイプは...',
    ],

    '3' => [
        'name' => 'NONSTYLE　石田',
        'description' => 'あなたは「ブラックマヨネーズ」タイプです。このタイプは...',
    ],

    '4' => [
        'name' => 'NONSTYLE　井上',
        'description' => 'あなたは「ブラックマヨネーズ」タイプです。このタイプは...',
    ],

    '5' => [
        'name' => 'サンドウィッチマン　伊達',
        'description' => 'あなたは「ブラックマヨネーズ」タイプです。このタイプは...',
    ],

    '6' => [
        'name' => 'ミルクボーイ　駒場',
        'description' => 'あなたは「ブラックマヨネーズ」タイプです。このタイプは...',
    ],

    '7' => [
        'name' => 'トレンディエンジェル　斎藤さん',
        'description' => 'あなたは「ブラックマヨネーズ」タイプです。このタイプは...',
    ],

    '8' => [
        'name' => 'トレンディエンジェル　たかし',
        'description' => 'あなたは「ブラックマヨネーズ」タイプです。このタイプは...',
    ],

    '9' => [
        'name' => 'アンタッチャブル　ザキヤマ',
        'description' => 'あなたは「ブラックマヨネーズ」タイプです。このタイプは...',
    ],

    '10' => [
        'name' => '銀シャリ　鰻',
        'description' => 'あなたは「ブラックマヨネーズ」タイプです。このタイプは...',
    ],

    '11' => [
        'name' => 'マヂカルラブリー　野田クリスタル',
        'description' => 'あなたは「ブラックマヨネーズ」タイプです。このタイプは...',
    ],

    '12' => [
        'name' => 'ブラックマヨネーズ　小杉',
        'description' => 'あなたは「ブラックマヨネーズ」タイプです。このタイプは...',
    ],

    '13' => [
        'name' => 'チュートリアル　徳井',
        'description' => 'あなたは「ブラックマヨネーズ」タイプです。このタイプは...',
    ],

    '14' => [
        'name' => '霜降り明星　せいや',
        'description' => 'あなたは「ブラックマヨネーズ」タイプです。このタイプは...',
    ],
];


//results
// １　ブラックマヨネーズ　吉田
// ２　とろサーモン　久保田
// ３　NONSTYLE　石田
// ４　NONSTYLE　井上
// ５　サンドウィッチマン　伊達
// ６　ミルクボーイ　駒場
// ７　トレンディエンジェル　斎藤さん
// ８　トレンディエンジェル　たかし
// ９　アンタッチャブル　ザキヤマ
// １０　銀シャリ　鰻
// １１　マヂカルラブリー　野田クリスタル
// １２　ブラックマヨネーズ　小杉
// １３　チュートリアル　徳井
// １４　霜降り明星　せいや